lib/tasks/setup.rake

  task initial_data: :environment do
    # Criar departamento padrão
    department = Department.find_or_create_by!(name: "Departamento Padrão")

    # Criar usuário administrador
    admin = User.find_or_initialize_by(email: "admin@example.com")
    admin.update!(
      name: "Administrador",
      registration_number: "ADMIN001",
      role: 2, # admin
      department: department,
      password: "password123",
      password_confirmation: "password123"
    )

    # Criar usuário professor
    teacher = User.find_or_initialize_by(email: "teacher@example.com")
    teacher.update!(
      name: "Professor Exemplo",
      registration_number: "TEACHER001",
      role: 1, # teacher
      department: department,
      password: "password123",
      password_confirmation: "password123"
    )

    # Criar usuário estudante
    student = User.find_or_initialize_by(email: "student@example.com")
---
INSERT INTO "departments" ("name", "created_at", "updated_at") VALUES ('Departamento Padrão', '2025-02-05 02:52:08.712648', '2025-02-05 02:52:08.712648') RETURNING "id"
SELECT "departments".* FROM "departments" WHERE "departments"."name" = 'Departamento Padrão' LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."email" = 'admin@example.com' LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."email" = 'teacher@example.com' LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."email" = 'student@example.com' LIMIT 1

    )

    # Criar disciplinas de exemplo
    subject1 = Subject.find_or_create_by!(name: "Programação 1", code: "PROG1", department: department)
    subject2 = Subject.find_or_create_by!(name: "Banco de Dados", code: "BD", department: department)
    subject3 = Subject.find_or_create_by!(name: "Engenharia de Software", code: "ES", department: department)

    # Criar turmas de exemplo
    class1 = SchoolClass.find_or_create_by!(subject: subject1, semester: "2024.1")
    class2 = SchoolClass.find_or_create_by!(subject: subject2, semester: "2024.1")
    class3 = SchoolClass.find_or_create_by!(subject: subject3, semester: "2024.1")

    # Associar professor às turmas
    Enrollment.find_or_create_by!(school_class: class1, teacher: teacher)
    Enrollment.find_or_create_by!(school_class: class2, teacher: teacher)
    Enrollment.find_or_create_by!(school_class: class3, teacher: teacher)

    # Matricular estudante nas turmas
    Enrollment.find_or_create_by!(school_class: class1, user: student)
    Enrollment.find_or_create_by!(school_class: class2, user: student)

    # Criar template de avaliação
    template = FormTemplate.find_or_create_by!(name: "Avaliação da Disciplina") do |t|
---
INSERT INTO "subjects" ("name", "code", "department_id", "created_at", "updated_at") VALUES ('Programação 1', 'PROG1', 1, '2025-02-05 02:52:09.504216', '2025-02-05 02:52:09.504216') RETURNING "id"
SELECT "subjects".* FROM "subjects" WHERE "subjects"."name" = 'Programação 1' AND "subjects"."code" = 'PROG1' AND "subjects"."department_id" = 1 LIMIT 1
INSERT INTO "subjects" ("name", "code", "department_id", "created_at", "updated_at") VALUES ('Banco de Dados', 'BD', 1, '2025-02-05 02:52:09.508167', '2025-02-05 02:52:09.508167') RETURNING "id"
SELECT "subjects".* FROM "subjects" WHERE "subjects"."name" = 'Banco de Dados' AND "subjects"."code" = 'BD' AND "subjects"."department_id" = 1 LIMIT 1
INSERT INTO "subjects" ("name", "code", "department_id", "created_at", "updated_at") VALUES ('Engenharia de Software', 'ES', 1, '2025-02-05 02:52:09.511217', '2025-02-05 02:52:09.511217') RETURNING "id"
SELECT "subjects".* FROM "subjects" WHERE "subjects"."name" = 'Engenharia de Software' AND "subjects"."code" = 'ES' AND "subjects"."department_id" = 1 LIMIT 1
INSERT INTO "school_classes" ("subject_id", "semester", "created_at", "updated_at") VALUES (1, '2024.1', '2025-02-05 02:52:09.523699', '2025-02-05 02:52:09.523699') RETURNING "id"
SELECT "school_classes".* FROM "school_classes" WHERE "school_classes"."subject_id" = 1 AND "school_classes"."semester" = '2024.1' LIMIT 1
INSERT INTO "school_classes" ("subject_id", "semester", "created_at", "updated_at") VALUES (2, '2024.1', '2025-02-05 02:52:09.525716', '2025-02-05 02:52:09.525716') RETURNING "id"
SELECT "school_classes".* FROM "school_classes" WHERE "school_classes"."subject_id" = 2 AND "school_classes"."semester" = '2024.1' LIMIT 1
INSERT INTO "school_classes" ("subject_id", "semester", "created_at", "updated_at") VALUES (3, '2024.1', '2025-02-05 02:52:09.528293', '2025-02-05 02:52:09.528293') RETURNING "id"
SELECT "school_classes".* FROM "school_classes" WHERE "school_classes"."subject_id" = 3 AND "school_classes"."semester" = '2024.1' LIMIT 1
INSERT INTO "enrollments" ("user_id", "school_class_id", "role", "created_at", "updated_at", "teacher_id") VALUES (NULL, 1, NULL, '2025-02-05 02:52:09.547334', '2025-02-05 02:52:09.547334', 2) RETURNING "id"
SELECT "enrollments".* FROM "enrollments" WHERE "enrollments"."school_class_id" = 1 AND "enrollments"."teacher_id" = 2 LIMIT 1
INSERT INTO "enrollments" ("user_id", "school_class_id", "role", "created_at", "updated_at", "teacher_id") VALUES (NULL, 2, NULL, '2025-02-05 02:52:09.554329', '2025-02-05 02:52:09.554329', 2) RETURNING "id"
SELECT "enrollments".* FROM "enrollments" WHERE "enrollments"."school_class_id" = 2 AND "enrollments"."teacher_id" = 2 LIMIT 1
INSERT INTO "enrollments" ("user_id", "school_class_id", "role", "created_at", "updated_at", "teacher_id") VALUES (NULL, 3, NULL, '2025-02-05 02:52:09.558213', '2025-02-05 02:52:09.558213', 2) RETURNING "id"
SELECT "enrollments".* FROM "enrollments" WHERE "enrollments"."school_class_id" = 3 AND "enrollments"."teacher_id" = 2 LIMIT 1
INSERT INTO "enrollments" ("user_id", "school_class_id", "role", "created_at", "updated_at", "teacher_id") VALUES (3, 1, NULL, '2025-02-05 02:52:09.561939', '2025-02-05 02:52:09.561939', NULL) RETURNING "id"
SELECT "enrollments".* FROM "enrollments" WHERE "enrollments"."school_class_id" = 1 AND "enrollments"."user_id" = 3 LIMIT 1
INSERT INTO "enrollments" ("user_id", "school_class_id", "role", "created_at", "updated_at", "teacher_id") VALUES (3, 2, NULL, '2025-02-05 02:52:09.572032', '2025-02-05 02:52:09.572032', NULL) RETURNING "id"
SELECT "enrollments".* FROM "enrollments" WHERE "enrollments"."school_class_id" = 2 AND "enrollments"."user_id" = 3 LIMIT 1
INSERT INTO "form_templates" ("name", "questions", "created_at", "updated_at", "department_id") VALUES ('Avaliação da Disciplina', '[{"text":"Como você avalia o conteúdo da disciplina?","answer_type":"text","required":true},{"text":"De 0 a 10, qual nota você daria para a organização da disciplina?","answer_type":"number","required":true},{"text":"Como você classifica a carga horária da disciplina?","answer_type":"multiple_choice","options":["Adequada","Insuficiente","Excessiva"],"required":true}]', '2025-02-05 02:52:09.585308', '2025-02-05 02:52:09.585308', 1) RETURNING "id"
SELECT "form_templates".* FROM "form_templates" WHERE "form_templates"."name" = 'Avaliação da Disciplina' LIMIT 1

    end

    # Criar formulário para avaliação
    Form.find_or_create_by!(
      form_template: template,
      school_class: class2,
      target_audience: :students,
      status: :active
    )
---
INSERT INTO "forms" ("school_class_id", "form_template_id", "status", "created_at", "updated_at", "target_audience") VALUES (2, 1, 1, '2025-02-05 02:52:09.601576', '2025-02-05 02:52:09.601576', 0) RETURNING "id"
SELECT "forms".* FROM "forms" WHERE "forms"."form_template_id" = 1 AND "forms"."school_class_id" = 2 AND "forms"."target_audience" = 0 AND "forms"."status" = 1 LIMIT 1