lib/tasks/sigaa.rake

  task import: :environment do
    # Carrega os arquivos JSON
    classes_json = JSON.parse(File.read(Rails.root.join("classes.json")))
    members_json = JSON.parse(File.read(Rails.root.join("class_members.json")))

    # Cria departamento padrão para CIC
    department = Department.find_or_create_by!(name: "DEPTO CIÊNCIAS DA COMPUTAÇÃO")

    # Processa disciplinas e turmas
    classes_json.each do |class_data|
      # Cria ou atualiza a disciplina
      subject = Subject.find_or_create_by!(code: class_data["code"]) do |s|
        s.name = class_data["name"]
        s.department = department
      end

      # Cria ou atualiza a turma
      school_class = SchoolClass.find_or_create_by!(
        subject: subject,
        semester: class_data["class"]["semester"]
      )
    end

    # Processa membros das turmas
    members_json.each do |class_members|
      # Encontra a disciplina e turma
      subject = Subject.find_by!(code: class_members["code"])
      school_class = SchoolClass.find_by!(
        subject: subject,
        semester: class_members["semester"]
      )

      # Processa o professor
      teacher_data = class_members["docente"]
      teacher = User.find_or_initialize_by(registration_number: teacher_data["usuario"])
---
INSERT INTO "departments" ("name", "created_at", "updated_at") VALUES ('DEPTO CIÊNCIAS DA COMPUTAÇÃO', '2025-02-05 03:30:42.738748', '2025-02-05 03:30:42.738748') RETURNING "id"
SELECT "departments".* FROM "departments" WHERE "departments"."name" = 'DEPTO CIÊNCIAS DA COMPUTAÇÃO' LIMIT 1
INSERT INTO "subjects" ("name", "code", "department_id", "created_at", "updated_at") VALUES ('BANCOS DE DADOS', 'CIC0097', 1, '2025-02-05 03:30:42.821780', '2025-02-05 03:30:42.821780') RETURNING "id"
SELECT "subjects".* FROM "subjects" WHERE "subjects"."code" = 'CIC0097' LIMIT 1
INSERT INTO "school_classes" ("subject_id", "semester", "created_at", "updated_at") VALUES (1, '2021.2', '2025-02-05 03:30:42.836634', '2025-02-05 03:30:42.836634') RETURNING "id"
SELECT "school_classes".* FROM "school_classes" WHERE "school_classes"."subject_id" = 1 AND "school_classes"."semester" = '2021.2' LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."registration_number" = '83807519491' LIMIT 1

      teacher.save!

      # Cria matrícula do professor
      Enrollment.find_or_create_by!(
        school_class: school_class,
        teacher: teacher,
        role: :teacher
      )

      # Processa os alunos
      class_members["dicente"].each do |student_data|
        student = User.find_or_initialize_by(registration_number: student_data["matricula"])
---
INSERT INTO "enrollments" ("user_id", "school_class_id", "role", "created_at", "updated_at", "teacher_id") VALUES (NULL, 1, NULL, '2025-02-05 03:30:43.055232', '2025-02-05 03:30:43.055232', 1) RETURNING "id"
SELECT "enrollments".* FROM "enrollments" WHERE "enrollments"."school_class_id" = 1 AND "enrollments"."teacher_id" = 1 AND "enrollments"."role" = NULL LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."registration_number" = '190084006' LIMIT 1

        student.save!

        # Cria matrícula do aluno
        Enrollment.find_or_create_by!(
          school_class: school_class,
          user: student,
          role: :student
        )
---
INSERT INTO "users" ("name", "registration_number", "role", "department_id", "created_at", "updated_at", "email", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at", "force_password_change") VALUES ('Ana Clara Jordao Perna', '190084006', 0, 1, '2025-02-05 03:30:43.240684', '2025-02-05 03:30:43.240684', 'acjpjvjp@gmail.com', '$2a$12$o7FXPcABTm64ATclPM9GH.vSkX99.7f6n0QCTc.fmZt.anLYlkPNi', NULL, NULL, NULL, 1) RETURNING "id"
INSERT INTO "enrollments" ("user_id", "school_class_id", "role", "created_at", "updated_at", "teacher_id") VALUES (2, 1, NULL, '2025-02-05 03:30:43.243379', '2025-02-05 03:30:43.243379', NULL) RETURNING "id"
SELECT "enrollments".* FROM "enrollments" WHERE "enrollments"."school_class_id" = 1 AND "enrollments"."user_id" = 2 AND "enrollments"."role" = NULL LIMIT 1