app/controllers/form_templates_controller.rb

  def index
    @form_templates = FormTemplate.where(department: current_user.department)
---
SELECT "form_templates".* FROM "form_templates" WHERE "form_templates"."department_id" = 1
SELECT "departments".* FROM "departments" WHERE "departments"."id" = 1 LIMIT 1