app/controllers/password_setups_controller.rb

UPDATE "users" SET "updated_at" = '2025-02-05 03:31:52.971514', "encrypted_password" = '$2a$12$hnB160oExwKVsEKvCXGkFedvDeaoPrtDopsGwrRE6XCIgNpSLXkd6' WHERE "users"."id" = 1
---
  def update
    if current_user.update_with_password(password_params)