app/views/form_templates/index.html.erb

            <td class="px-6 py-4 whitespace-nowrap text-sm text-gray-500">
              <%= pluralize(template.forms.count, 'formulário', 'formulários') %>
---
SELECT COUNT(*) FROM "forms" WHERE "forms"."form_template_id" = 1